/*// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.Write("Input number which have 3 figure:  ");
int num = Convert.ToInt32(Console.ReadLine());

int ed=num%10;
int sot=num/100;

int result=(num-sot*100-ed)/10;

Console.Write ($"The  second figure of number is: {result} ");
Console.WriteLine();

*/